[
  {
    "projectId": 1,
    "githubLink": "https://github.com/AnandTagatghar/MusicCourseWebClone",
    "projectLink": "https://music-course-web-clone.vercel.app",
    "screenShot1": "/P1S1.jpg",
    "screenShot2": "/P1S2.jpg",
    "screenShot3": "/P1S3.jpg",
    "screenShot4": "/P1S4.jpg",
    "projectDescription": "This project is a modern clone of a music course website built with Next.js, showcasing a responsive and clean UI. It features a compelling hero section, featured courses in areas like guitar, vocals, and music production, and an emphasis on personalized learning. The site includes sections on live feedback, interactive learning, and a dynamic instructor showcase. Designed with a focus on user experience, the clone replicates a professional music education platform suitable for all skill levels. This project highlights my frontend development skills, attention to UI/UX, and ability to build engaging, real-world web interfaces.",
    "projectMainPageImage": "/P1S1.jpg",
    "projectTitle": "Music School Web Clone"
  },
  {
    "projectId": 2,
    "githubLink": "https://github.com/AnandTagatghar/FeedbackMessagingClone",
    "projectLink": "https://feedback-messaging-clone.vercel.app",
    "screenShot1": "/P2S1.png",
    "screenShot2": "/P2S2.png",
    "screenShot3": "/P2S3.png",
    "screenShot4": "/P2S4.png",
    "projectDescription": "Get Feedback” is a streamlined, no-sign-up platform that empowers creators to receive honest, anonymous critiques on their projects. Simply upload your work, generate a shareable link, and gather constructive insights from peers—free from bias and social pressure. The intuitive interface eliminates complexity, encouraging genuine feedback that fuels growth. Whether you seek design insights, coding suggestions, or early‑stage feedback, this tool delivers actionable input in a seamless, accessible way. No accounts, no hassle—just meaningful critiques that help you refine ideas, elevate your craft, and build with confidence.",
    "projectMainPageImage": "/P2S1.png",
    "projectTitle": "Get Feedback — Effortless Anonymous Project Reviews"
  },
  {
    "projectId": 3,
    "githubLink": "https://github.com/AnandTagatghar/EmployeeTaskManagement",
    "projectLink": "",
    "screenShot1": "/P3S1.png",
    "screenShot2": "/P3S2.png",
    "screenShot3": "",
    "screenShot4": "",
    "projectDescription": "This is a role-based task management web application designed to streamline employee task assignments and tracking. The system features a secure login that differentiates between admin and employee users using localStorage. Admins can assign tasks to employees and monitor progress, while employees can view tasks by status (New, In Progress, Completed), accept tasks, and update their status through intuitive CRUD operations. The application ensures efficient collaboration and task transparency within an organization. Built with a focus on user experience and productivity, it provides a clean UI and essential functionality for small to mid-sized teams.",
    "projectMainPageImage": "/P3S1.png",
    "projectTitle": "Employee Task Management System"
  }
]
